; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_65)

(:domain logistics)

(:objects
	obj0 obj2 obj9 - airport
	obj1 obj3 obj10 - city
	obj4 obj8 obj11 obj14 obj15 obj16 obj17 - package
	obj5 obj6 obj13 - truck
	obj7 - location
	obj12 - airplane
)

(:init
	(at obj4 obj0)
	(at obj5 obj0)
	(at obj6 obj2)
	(at obj8 obj0)
	(at obj11 obj9)
	(at obj12 obj9)
	(at obj13 obj9)
	(at obj14 obj2)
	(at obj15 obj9)
	(at obj16 obj9)
	(at obj17 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj7 obj1)
	(in-city obj9 obj10)
)

(:goal (and
	(at obj4 obj2)
	(at obj8 obj2)
	(at obj11 obj7)
	(at obj14 obj7)
	(at obj15 obj7)
	(at obj16 obj2)
	(at obj17 obj2)
))
)

; plan
1. (load obj12 obj11 obj9)
   deleted: (at obj11 obj9)
   added: (in obj11 obj12)
   goals met: 0 of 7
2. (load obj12 obj15 obj9)
   deleted: (at obj15 obj9)
   added: (in obj15 obj12)
   goals met: 0 of 7
3. (load obj12 obj16 obj9)
   deleted: (at obj16 obj9)
   added: (in obj16 obj12)
   goals met: 0 of 7
4. (fly obj12 obj9 obj2)
   deleted: (at obj12 obj9)
   added: (at obj12 obj2)
   goals met: 0 of 7
5. (load obj12 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj12)
   goals met: 0 of 7
6. (fly obj12 obj2 obj0)
   deleted: (at obj12 obj2)
   added: (at obj12 obj0)
   goals met: 0 of 7
7. (load obj12 obj17 obj0)
   deleted: (at obj17 obj0)
   added: (in obj17 obj12)
   goals met: 0 of 7
8. (load obj12 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj12)
   goals met: 0 of 7
9. (load obj12 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj12)
   goals met: 0 of 7
10. (unload obj12 obj11 obj0)
   deleted: (in obj11 obj12)
   added: (at obj11 obj0)
   goals met: 0 of 7
11. (unload obj12 obj14 obj0)
   deleted: (in obj14 obj12)
   added: (at obj14 obj0)
   goals met: 0 of 7
12. (unload obj12 obj15 obj0)
   deleted: (in obj15 obj12)
   added: (at obj15 obj0)
   goals met: 0 of 7
13. (fly obj12 obj0 obj9)
   deleted: (at obj12 obj0)
   added: (at obj12 obj9)
   goals met: 0 of 7
14. (fly obj12 obj9 obj2)
   deleted: (at obj12 obj9)
   added: (at obj12 obj2)
   goals met: 0 of 7
15. (load obj5 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj5)
   goals met: 0 of 7
16. (load obj5 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj5)
   goals met: 0 of 7
17. (load obj5 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj5)
   goals met: 0 of 7
18. (drive obj5 obj0 obj7)
   deleted: (at obj5 obj0)
   added: (at obj5 obj7)
   goals met: 0 of 7
19. (unload obj12 obj16 obj2)
   deleted: (in obj16 obj12)
   added: (at obj16 obj2)
   goals met: 1 of 7
20. (unload obj12 obj17 obj2)
   deleted: (in obj17 obj12)
   added: (at obj17 obj2)
   goals met: 2 of 7
21. (unload obj12 obj4 obj2)
   deleted: (in obj4 obj12)
   added: (at obj4 obj2)
   goals met: 3 of 7
22. (unload obj12 obj8 obj2)
   deleted: (in obj8 obj12)
   added: (at obj8 obj2)
   goals met: 4 of 7
23. (unload obj5 obj11 obj7)
   deleted: (in obj11 obj5)
   added: (at obj11 obj7)
   goals met: 5 of 7
24. (unload obj5 obj14 obj7)
   deleted: (in obj14 obj5)
   added: (at obj14 obj7)
   goals met: 6 of 7
25. (unload obj5 obj15 obj7)
   deleted: (in obj15 obj5)
   added: (at obj15 obj7)
   goals met: 7 of 7
